IDEA Open Model
MatSteelAISC.fy40 Property
Compatible with IDEA StatiCa v 10.1
 Yield strength for nominal thickness of the element > 40mm and <= 100mm - fy,(>40)
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public double fy40 { get; set; }
Public Property fy40 As Double
	Get
	Set
public:
property double fy40 {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
MatSteelAISC Class
IdeaRS.OpenModel.Material Namespace